#include <stdio.h>
int main ()
{
	int a,i,j,t;
	int p[1000][2];//表示一共有 n 条需要排序的线段和每行两个整数
	scanf ("%d",&a);
	for (i=0;i<a;i++)
	{
		scanf("%d%d",&p[i][0],&p[i][1]);//左端和右端坐标
	}
	for (i=0;i<a;i++)
	{
		for (j=i+1;j<a;j++)
		{
			if(p[i][0]>p[j][0])//在左端坐标不一样的时候，按照左端坐标从小到大排序
			{
				t=p[i][0];
				p[i][0]=p[j][0];
				p[j][0]=t;
				t=p[i][1];
				p[i][1]=p[j][1];
				p[j][1]=t;
			}
		}
	}
	for (i=0;i<a;i++)
	{
		for (j=i+1;j<a;j++)
		{
			if(p[i][0]==p[j][0]&&p[i][1]>p[j][1])//在左端坐标相等的时候，按照右端坐标从小到大排序。
			{
				t=p[i][1];
				p[i][1]=p[j][1];
				p[j][1]=t;
			}
		}
	}
	for (i=0;i<a;i++)
	{
		printf("%d %d\n",p[i][0],p[i][1]);//每一行两个整数，为每条线段的左端和右端坐标， 以一个空格分隔
	}
	return 0;
}
